app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Second to last"], ["description", "thing jsidjaojdoiasjfoi"], ["created_at", "2019-02-21 21:31:39.611859"], ["updated_at", "2019-02-21 21:31:39.611859"]]
---
  def create
    @article = Article.new(article_params)
    # @article.user = User.first
      if @article.save

DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 4]]
---
 def destroy
  # @article = Article.find(params[:id])
  @article.destroy

UPDATE "articles" SET "description" = $1, "updated_at" = $2 WHERE "articles"."id" = $3
---
 def update
  # @article = Article.find(params[:id])
  if @article.update(article_params)